## Plan Result (stg_appgw)




<pre><code>Plan: 0 to add, 1 to change, 0 to destroy.</code></pre>

* Update
  * azurerm_application_gateway.this




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_gateway.this will be updated in-place
  ~ resource "azurerm_application_gateway" "this" {
        id                                = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg"
        name                              = "crime-portal-appgw-stg"
        tags                              = {
            "application"  = "crime-portal"
            "builtFrom"    = "hmcts/crime-portal-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (7 unchanged attributes hidden)

      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/frontendIPConfigurations/crime-portal-private-stg" -> null
          - frontend_ip_configuration_name = "crime-portal-private-stg" -> null
          - frontend_port_id               = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/frontendPorts/http" -> null
          - frontend_port_name             = "http" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/httpListeners/crime-portal-http-listener" -> null
          - name                           = "crime-portal-http-listener" -> null
          - protocol                       = "Http" -> null
          - require_sni                    = false -> null
        }
      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/frontendIPConfigurations/crime-portal-private-stg" -> null
          - frontend_ip_configuration_name = "crime-portal-private-stg" -> null
          - frontend_port_id               = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/frontendPorts/https" -> null
          - frontend_port_name             = "https" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/httpListeners/crime-portal-https-listener" -> null
          - name                           = "crime-portal-https-listener" -> null
          - protocol                       = "Https" -> null
          - require_sni                    = false -> null
          - ssl_certificate_id             = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/sslCertificates/crime-portal-uat-ssl-cert" -> null
          - ssl_certificate_name           = "crime-portal-uat-ssl-cert" -> null
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "crime-portal-private-stg"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "Http"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "crime-portal-http-listener"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
          + ssl_profile_id                 = (known after apply)
        }
      + http_listener {
          + frontend_ip_configuration_id   = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/frontendIPConfigurations/crime-portal-private-stg"
          + frontend_ip_configuration_name = "crime-portal-private-stg"
          + frontend_port_id               = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/frontendPorts/https"
          + frontend_port_name             = "https"
          + host_names                     = []
          + id                             = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/httpListeners/crime-portal-https-listener"
          + name                           = "crime-portal-https-listener"
          + protocol                       = "Https"
          + ssl_certificate_id             = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-stg/sslCertificates/crime-portal-uat-ssl-cert"
          + ssl_certificate_name           = "crime-portal-uat-ssl-cert"
        }

        # (19 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":47,"Program":"tfcmt","SHA1":"","Target":"stg_appgw","Vars":{}} -->